app/controllers/tweet_controller.rb

SELECT * FROM "panels" WHERE ("panels"."name" = 'games') LIMIT 1
SELECT "tweets".* FROM "tweets" INNER JOIN "panel_tweets" ON "tweets".id = "panel_tweets".tweet_id WHERE (("panel_tweets".panel_id = 1)) ORDER BY timestamp desc LIMIT 25
---
  def index

    @panel = Panel.find_by_name(params[:panel])
    @panel.fetch

    @tweets = @panel.tweets.find(:all, :limit => "25", :order => " timestamp desc").slice(10, 15)

SELECT * FROM "panels" WHERE ("panels"."name" = 'games') LIMIT 1
SELECT "tweets".* FROM "tweets" INNER JOIN "panel_tweets" ON "tweets".id = "panel_tweets".tweet_id WHERE (("panel_tweets".panel_id = 1) AND (timestamp > '')) ORDER BY timestamp asc LIMIT 1
---
  def tweet

    panel = Panel.find_by_name(params[:panel])

    tweet = panel.tweets.find(:first, :conditions => "timestamp > '#{params[:since]}'", :order => " timestamp asc")